Repository: jimregan/citizens-information-raw
Catalog: en-pl/www.citizensinformation.ie/pl/education/third_level_education/colleges_and_qualifications/third_level_qualifications.html.txt.tmx
Source language: en
Languages: pl

source: Further and higher education qualifications
pl: Kwalifikacje wynikające z wykształcenia pomaturalnego i wyższego

source: Different bodies are entitled to award or validate qualifications in the further and higher education sectors
pl: Obecnie istnieje wiele instytucji przyznających lub potwierdzających kwalifikacje do pracy w sektorach wymagających wykształcenia pomaturalnego i wyższego w Irlandii

source: Further education and training is education and training between post-primary level and higher education
pl: Edukacja pomaturalna i szkolenia to taka edukacja i szkolenia, które mieszczą się pomiędzy edukacją na poziomie ponadpodstawowym i wyższym

source: Higher education and training is provided mainly in universities and colleges of technology or equivalent bodies
pl: Edukacja wyższa i szkolenia w Irlandii świadczone są głównie przez uniwersytety i kolegia techniczne lub uczelnie będące ich odpowiednikami

source: • Universities:The State-supported universities all award their own degrees and other awards
pl: • Uniwersytety: Obecnie wszystkie uniwersytety finansowane przez państwo nadają własne stopnie naukowe i inne tytuły

source: • Institutes of technology: The Dublin Institute of Technology also makes its own awards
pl: • Instytuty technologiczne: Instytut Technologiczny w Dublinie (The Dublin Institute of Technology) ma również swoje własne możliwości nominowania

source: The other institutes of technology grant degrees, diplomas and certificates which are validated by Quality and Qualifications Ireland
pl: Inne instytuty technologiczne przyznają stopnie naukowe, dyplomy i certyfikaty, uprawomocnione przez Jakość i Kwalifikacje (Quality and Qualifications) Irlandia

source: • Other colleges: The other State-supported colleges generally grant awards that are validated by Quality and Qualifications Ireland
pl: • Inne uczelnie: Inne uczelnie państwowe generalnie przyznają świadczenia, uprawomocnione przez Jakość i Kwalifikacje (Quality and Qualifications) Irlandia

source: • Private colleges: The private colleges make awards, some of which are validated by foreign universities and some of which are validated by Quality and Qualifications Ireland
pl: • Uczelnie prywatne: Prywatne uczelnie premiują także, część z nich jest uprawomocniona przez uniwersytety zagraniczne, a część przez Jakość i Kwalifikacje (Quality and Qualifications) Irlandia

source: Some of their awards are not validated by any outside body
pl: Niektóre z ich nominacji nie są uprawomocnione przez żadną instytucję zewnętrzną

source: Quality and Qualifications Ireland
pl: Jakość i Kwalifikacje w Irlandii (Quality and Qualifications)

source: Quality and Qualifications Ireland (QQI) was established on 6 November 2012 under the Qualifications and Quality Assurance (Education and Training) Act 2012
pl: Quality and Qualifications Ireland (QQI) powstał dnia 6 listopada 2012 r., na podstawie Ustawy o kwalifikacjach i zapewnieniu jakości (Kształcenie i szkolenie (the Qualifications and Quality Assurance (Education and Training) z 2012 r

source: It has taken over the functions of the following 4 bodies:
pl: Instytucja ta przejęła funkcje następujących czterech urzędów:

source: • National Qualifications Authority of Ireland (NQAI)
pl: • Państwowy Urząd Kwalifikacji Irlandii (National Qualifications Authority of Ireland - NQAI) • Rada ds

source: • Further Education and Training Awards Council (FETAC)
pl: zdobywania dalszej edukacji i szkolenia (Further Education and Training Awards Council - FETAC)

source: • Higher Education and Training Awards Council (HETAC)
pl: • Rada ds. zdobywania wyższego wykształcenia i szkolenia (Higher Education and Training Awards Council - HETAC)

source: • Irish Universities Quality Board (IUQB)
pl: • Zarząd Jakościowy Uniwersytetów Irlandzkich (Irish Universities Quality Board - IUQB)

source: The Qualifications Recognition service at the NQAI included the recognition of foreign qualifications and the International Qualifications Database
pl: Kwalifikacji w Irlandii (National Qualifications Authority of Ireland)

source: The IUQB was responsible for quality assurance in the Irish university sector
pl: NQAI między innymi odpowiedzialny był za sporządzanie i utrzymywanie Państwowych struktur kwalifikacji (National Framework of Qualifications), ustalanie procedur dla rad oraz decyzje dotyczące procedur wprowadzanych przez organizatorów nauczania, związanych z dostępem, przekazywaniem i dalszym rozwojem wykształcenia

source: It conducted regular external reviews of quality procedures in Irish universities
pl: Do obowiązków służb zajmujących się w NQAI kwestią uznania kwalifikacji, należy także uznanie kwalifikacji zagranicznych oraz prowadzenie Międzynarodowej bazy danych kwalifikacji

source: The two awarding bodies - the Further Education and Training Awards Council (FETAC) and the Higher Education and Training Awards Council (HETAC) - were the certification bodies for all of the education and training in the State other than that in primary and post-primary education and in the universities and the Dublin Institute of Technology
pl: zdobywania dalszej edukacji i szkolenia (Further Education and Training Awards Council - FETAC) oraz Rada ds. zdobywania wyższego wykształcenia i szkolenia (Higher Education and Training Awards Council - HETAC) byly to instytucje nadające w kraju certyfikaty wykształcenia i przeszkolenia, poza szkołami kształcącymi w zakresie podstawowym i gimnazjalnym oraz uniwersytetami i Instytutem Technologii w Dublinie

source: HETAC could delegate authority to institutes of technology to make higher education and training awards
pl: HETAC miał możliwość przekazania instytutom technologii uprawnienia przyznawania certyfikatów ukończenia studiów wyższych oraz szkoleń

source: There was a similar facility within FETAC
pl: Podobne uprawnienia posiadał FETAC

source: The principal functions of FETAC and HETAC were:
pl: Podstawowymi funkcjami FETAC i HETAC było:

source: • The establishment of policies and criteria for the making of awards
pl: • Ustalenie polityki i kryteriów przyznawania certyfikatów

source: • The validation of programmes in further or higher education and training
pl: • Uprawomocnienie programów dotyczących dalszego lub wyższego wykształcenia oraz szkoleń

source: • The setting of standards of knowledge, skill or competence which must be acquired by learners, before an award may be made
pl: • Ustanowienie standardów wiedzy, umiejętności lub kompetencji, jakie muszą zostać osiągnięte przez uczniów przed otrzymaniem certyfikatu

source: Awards and qualifications formerly made by FETAC and HETAC continue to be recognised, because they are on the National Framework of Qualifications
pl: Przyznane uprzednio przez FETAC oraz HETAC tytuły i kwalifikacje uznawane są w dalszym ciągu, ponieważ umieszczone zostały w Państwowych Strukturach Kwalifikacji

source: If you are enrolled on a programme leading to a FETAC or HETAC award, your award will now be made by Quality and Qualifications Ireland
pl: Jeżeli jesteście uczestnikami programu, który gwarantował uzyskanie certyfikatu FETAC lub HETAC, obecnie certyfikat będzie przyznany przez Jakość i Kwalifikacje Irlandia

source: All providers of education and training need to inform learners of the transfer and progression routes that are available for them if they undertake a particular course
pl: Wszystkie instytucje edukacyjne muszą poinformować studentów o ścieżkach przekazywania wiedzy i podnoszenie kwalifikacji, które są im dostępne, jeżeli przystąpią do danego kursu

source: Individual learners may also approach QQI directly to seek certification or recognition for their existing knowledge, skill or competence
pl: Uczniowie indywidualni mogą także zwrócić się bezpośrednio do instytucji Jakość i Kwalifikacje Irlandia (QQI) o przyznanie certyfikatu bądź uznania posiadanej wiedzy, umiejętności lub kompetencji

source: It will be a matter for QQI to decide how this prior learning and prior experience can be assessed and they may look for help and advice from the providers of education and training in making this assessment
pl: Do QQI należeć będzie decyzja dotycząca oceny uzyskanego uprzednio wykształcenia i doświadczenia, może też zwrócić się o pomoc i radę przy tej ocenie do organizatorów kształcenia i szkoleń

source: There are specific provisions for the protection of learners where a provider operates programmes of education and training on a commercial and profit-making basis
pl: Istnieją specyficzne zapisy ochrony studentów w sytuacji, w której instytucja edukacyjna będzie realizował programy edukacji i szkolenia na zasadzie handlowej i ukierunkowanej na zysk

source: Such programmes will not be recognised by QQI unless there are provisions in place to ensure that the provider can provide an alternative place in another institution, or has a reserve fund or is adequately insured
pl: Programy takie nie będą uznawane przez QQI, chyba że istnieją zabezpieczenia, a mianowicie organizator może zapewnić alternatywne miejsce w innej instytucji, posiada fundusz rezerwowy lub odpowiednie ubezpieczenie
